const SHIP_TYPE = <int, String>{
  1: '航母',
  2: '轻母',
  3: '装母',
  4: '战列',
  5: '航战',
  6: '战巡',
  7: '重巡',
  8: '航巡',
  9: '雷巡',
  10: '轻巡',
  11: '重炮',
  12: '驱逐',
  13: '潜母',
  14: '潜艇',
  15: '炮潜',
  16: '补给',
  23: '导驱',
  24: '防驱',
  26: '导战'
};

const SERVER_LIST = <int, String>{
  0: '胡德',
  1: '俾斯麦',
  2: '昆西',
  3: '长春',
  4: '列克星敦',
  5: '维内托'
};

const CAMPAIGN_MAP = <int, String>{
  101: '驱逐简单战役',
  102: '驱逐困难战役',
  201: '巡洋简单战役',
  202: '巡洋困难战役',
  301: '战列简单战役',
  302: '战列困难战役',
  401: '航母简单战役',
  402: '航母困难战役',
  501: '潜艇简单战役',
  502: '潜艇困难战役',
};

const FLEET_FORMAT = <int, String>{
  1: '单纵',
  2: '复纵',
  3: '轮形',
  4: '梯形',
  5: '单横',
};

const PVP_RESULT = <int, String>{
  0: '-',
  1: 'SS',
  2: 'S',
  3: 'A',
  4: 'B',
  5: 'C',
  6: 'D'
};
